Revit 2016 API
MacroManager.GetEnumerator Method
Returns an enumerator that iterates through the Macro modules.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public virtual IEnumerator<MacroModule> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of MacroModule)
Visual C++
public:
virtual IEnumerator<MacroModule^>^ GetEnumerator()
Return Value
An IEnumerator(MacroModule) object that can be used to iterate through key-value pairs in the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace